app/Models/Bendahara_Model.php

SELECT *
FROM `bendahara`
SELECT *
FROM `bendahara`
WHERE `kode_user` = '23'
---
    public function getBendahara($kode_user = false)
    {
        if ($kode_user === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['kode_user' => $kode_user]);

INSERT INTO `bendahara` (`kode_user`, `username`, `pass`) VALUES ('233', 'Riski23', '234')
UPDATE `bendahara` SET `kode_user` = '23', `username` = 'Riski', `pass` = '22'
WHERE `kode_user` = '23'
---
    public function saveBendahara($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);
    }public function editBendahara($data, $kode_user)
    {
        $builder = $this->db->table($this->table);
        $builder->where('kode_user', $kode_user);
        return $builder->update($data);