app/Models/Employee_Model.php

    public function getKaryawan($id = false)
    {
        if ($id === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['id' => $id]);
---
SELECT *
FROM `employees`
SELECT *
FROM `employees`
WHERE `id` = '3'

    public function saveKaryawan($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);
    }public function editKaryawan($data, $id)
    {
        $builder = $this->db->table($this->table);
        $builder->where('id', $id);
        return $builder->update($data);
---
UPDATE `employees` SET `nama_karyawan` = 'Riski', `usia` = '20', `status_vaksin_1` = 'sudah', `status_vaksin_2` = ''
WHERE `id` = '3'