app/Models/Pegawai_Model.php

    public function getPegawai($kode_pegawai = false)
    {
        if ($kode_pegawai === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['kode_pegawai' => $kode_pegawai]);
---
SELECT *
FROM `pegawai`
SELECT *
FROM `pegawai`
WHERE `kode_pegawai` = '2'

    public function editPegawai($data, $kode_pegawai)
    {
        $builder = $this->db->table($this->table);
        $builder->where('kode_pegawai', $kode_pegawai);
        return $builder->update($data);
---
UPDATE `pegawai` SET `kode_pegawai` = '2', `nama_pegawai` = 'Riski', `tmpt_lahir` = 'Jakarta', `tgl_lahir` = '', `agama` = 'Islam', `pedetar` = 'Sma', `jenis_kelamin` = '', `tmt` = '', `golongan` = '', `jabatan` = 'Admin', `status_pegawai` = '', `status_pernikahan` = '', `jumlah_anak` = '0', `alamat` = 'Lampung', `gaji_pokok` = '10000', `no_tlp` = '1010282'
WHERE `kode_pegawai` = '2'