app/Models/Penggajian_Model.php

SELECT *
FROM `penggajian`
SELECT *
FROM `penggajian`
WHERE `kode_penggajian` = '1'
---
    public function getPenggajian($kode_penggajian = false)
    {
        if ($kode_penggajian === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['kode_penggajian' => $kode_penggajian]);

INSERT INTO `penggajian` (`kode_penggajian`, `tunj_istri_suami`, `tunj_anak`, `tunj_jabatan`, `tunj_beras`, `tukin`, `uang_makan`, `pot_rwp`, `pot_pph`, `biapetarum`, `sewa_rmh_dinas`, `gaji_bersih`, `kode_pegawai`, `kode_tunjangan`, `kode_potongan`) VALUES ('23', '10000000', '10000000', '100000000', '100000', '30000', '500000', '300000', '1000000', '2000', '20000', '2000', '233', '2', '200000')
---
    public function savePenggajian($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);

DELETE FROM `penggajian`
WHERE `kode_penggajian` = '1'
---
    public function hapusPenggajian($kode_penggajian)
    {
        $builder = $this->db->table($this->table);
        return $builder->delete(['kode_penggajian' => $kode_penggajian]);