app/Models/Potongan_Model.php

    public function getPotongan($kode_potongan = false)
    {
        if ($kode_potongan === false) {
            return $this->findAll();
---
SELECT *
FROM `potongan`