app/Models/Tunjangan_Model.php

SELECT *
FROM `tunjangan`
---
    public function getTunjangan($kode_tunjangan = false)
    {
        if ($kode_tunjangan === false) {
            return $this->findAll();